[
  {
    "name": "about.md",
    "id": "/about.md",
    "url": "/about.html",
    "title": "About Daikoku",
    "content": "# About Daikoku\n\nWhile [Otoroshi](https://maif.github.io/otoroshi/) is the perfect tool to manage your webapps in a technical point of view it lacked of business perspective. This is not the case anymore whith **Daikoku**.\n\nWhile **Otoroshi** is a standalone, Daikoku is a developer portal which stands in front of **Otoroshi** and provides some business feature.\n\nWhether you want to use **Daikoku** for your public APIs you want to monetize or with your private APIs to provide some documentation, facilitation and self-service feature, it will be the perfect portal for **Otoroshi**.\n\n## Philosophy \n\nEvery OSS product build at <a href=\"https://www.maif.fr/\" target=\"_blank\">MAIF</a> like <a href=\"https://maif.github.io/otoroshi/\" target=\"_blank\">Otoroshi</a> or <a href=\"https://maif.github.io/izanami/\" target=\"_blank\">Izanami</a> follow a common philosophy. \n\n* the services or API provided should be technology agnostic.\n* http first: http is the right answer to the previous quote   \n* api First: The UI is just another client of the api. \n* secured: The services exposed need authentication for both humans or machines  \n* event based: The services should expose a way to get notified of what happened inside. \n\n## Rights and Permissions in Daikoku\n\nIn Daikoku, users' rights and permissions are managed within a hierarchical structure that includes multiple nested entities, as illustrated in the following simplified diagram:\n\nDaikoku -> Tenants -> Teams -> APIs\n\n\n> Users in Daikoku have a multi-tenant context, which allows them to access multiple tenants without the need for multiple accounts. \n\nThe highest level of access is granted to the Super Admin, who has full control over the entire system. From there, rights and permissions are managed at the team level.\n\nHere are the different levels of permissions within a team:\n\n- **Super Admin**: Users with this role have both Read (R) and Write (W) permissions, granting them complete control over all entities in the system, including tenants.\n\n- **Administrator**: Administrators have Read (R) permissions across the entire team, allowing them to view all entities, but they can only Write (W) to specific elements within the team. They cannot modify tenant-related settings.\n\n- **API Editor**: Users with this role have Read (R) permissions for all entities within the team, but they can only Write (W) to APIs. They cannot modify tenant settings or perform actions on subscriptions.\n\n- **User**: Users with this role have Read (R) permissions, which enable them to access certain functionalities like requesting subscriptions, viewing APIs, and checking their subscription details. However, they do not have Write (W) permissions and are restricted from performing any modifications.\n\nPlease note that the \"API keys visibility\" option of the team (by default set to \"User\") restricts the visibility of API keys to specific levels of authorization within the team.\n\n> During the creation of a tenant, a special administrative team is automatically created, granting additional rights and permissions specific to managing the tenant itself, such as configuration, access to messaging, or management of CMS pages, for example.\n\nFor a more visual representation, you can refer to the following matrix:\n\n|            | Super Admin | Administrator | API Editor | User  |\n|------------|-------------|---------------|------------|-------|\n| Tenant     |      RW     |      R        |     R      |   R   |\n| Team       |      RW     |      RW       |     R      |   R   |\n| API        |      RW     |      RW       |     RW     |   R   |\n| Subscription |    RW     |      RW       |     -      |   R   |\n\n---\n"
  },
  {
    "name": "1-tenants.md",
    "id": "/adminusage/1-tenants.md",
    "url": "/adminusage/1-tenants.html",
    "title": "Managing tenants",
    "content": "# Managing tenants\n\nGo to `settings/Organizations settings`\n\nAnd you should see the list of the existing `tenants`.\n\n## Create a tenant\n\nTo create a new tenant, just click on the `create a new tenant` button.\n\n### General\n\nModify the name and the domain name of the current tenant.\nIt's possible to set the default language of the tenant.\nMaintenance Mode and construction mode can be activated here (only super and tenant admins can login).\n\nA robot.txt file is serve on the path /robot.txt. by default, the file is empty but, you can fill it like you want.\n\n\n### Customization\n\nTenants could be customized in Daikoku.\nLogo, title, description can be changed.\nThe client side can be customized with some css code or js code, with overwriting css variables or with a css/js file.\nDaikoku can be customized just on passing a new css color theme (ths theme can be rewritten by using the dedicated page by clicking on the `Set color theme from UI` button)\n\nYou can set a default message, visible for all user clicking on the message button, in the top of conversation modal.\n\nTo go further, it is possible to create new pages with the embedded @ref:[CMS](../tenantusage/6-cms.md)\n\n#### Footer\n\nA footer can be drawn by daikoku an all frontend page. Just fill code input with HTML code\n\n#### Unlogged home description\nThe unlogged home description is the first content shown to user for private tenant, before the login page.\nIt can also be enabled for public tenant.\n\n### Audit\n\nThe settings for the output of the audit trail can be set on this page.\nThe output of it, in addition to writing in database, can be an elastic, a kafka or webhooks.\n\nHere you can set the email adresses to report some Daikoku alert.\n\n### Mail\nThe mailer type, by default just the standard output.\nMailgun, Mailjet and Sendgrid can be configured as an sass solution.\nOtherwise, a smtp client can be configured.\n\n> The mail templates (one by supported languages) can be edited on the `internationalization page` accessible by clicking the `edit mail template` button.\n\n\n### Authentication\n\n\nAuthentication can be set by choosen Local auth. or a tiers auth. like LDAP, OAuth2 or Otoroshi.\nThe user session duration can be set here, by default it last 24h.\n\n### Bucket\nAn object storage can be set to store tenant and team assets.\n\n### Payment\n\nDaikoku offers full integration with online payment service, allowing users to easily manage their financial transactions as part of the subscription process.\n\n> Currently, only integration with [Stripe](https://stripe.com) is implemented, but our project is open to integrating with other payment platforms. Daikoku's code is designed to be modular, making it easier to add support for additional payment platforms. We welcome contributions to enhance our product in this area.\n\n#### Configuring Stripe\n\nBefore using Stripe with Daikoku, you need to complete the following steps:\n\n* **Create a Stripe Account**: Visit the Stripe website (stripe.com) to create an account. Follow Stripe's instructions to verify your identity and set up your payment account.\n\n* **Obtain Stripe API Keys**: Once your Stripe account is set up, you need to obtain the necessary API keys to communicate with the Stripe API from Daikoku. These keys include the secret API key and the public API key.\n\n* **Configure API Keys in Daikoku**: Access the Daikoku configuration settings (in the tenant configuration) and provide the Stripe API keys in the appropriate fields. This allows Daikoku to communicate with Stripe for payment handling.\n\nthe next step is to configure your API to accept payment. see this @ref:[part](../producerusage/1-apis.md) of the doc to learn more\n\n### Security\n\nA tenant can be private or public. In the last case, just public api can be accessed by unauthenticated users.\n\nA creation security option can be activated to forbid all unauthorized teams to create API. You just have to authorize the team from the team edit page.\n\nA subscription security option can be activated to forbid all personal team to subscribe to an API.\n\nAn API keys aggregation security can be activated to allow admin API to activate the possibility to aggregate the generated key with an existing API key. It must be activated in every plan\n\n> Beware the risk of override metadata between key using multiple plans. \n\nIt's possible to hide API Reference tab (for all APIs) to unlogged user. This is a feature primally intended for public tenants.\n\nIt's possible to hide teams page (/teams) to prevent everyone for knowing all teams in the organisation. This is a feature primally intended for public tenants.\n\n### Display mode\n\nIt's possible to switch tenant display mode from `default` to `environment`.\nsee this @ref:[part](../tenantusage/5.5-display.md) of the doc to learn more\n\n"
  },
  {
    "name": "2-users.md",
    "id": "/adminusage/2-users.md",
    "url": "/adminusage/2-users.html",
    "title": "Managing users",
    "content": "# Managing users\n\nUsers in Daikoku can be available in all tenants. As Daikoku admin, you are responsible for managing users.\n\n## Admin status\n\nNothing's easier to give or remove admin status to **another** user. Just hover the user's avatar and click on the `toggle admin status` button (shield icon).\nIt's impossible to remove oneself the admin status.\n\n## Create a new user\n\nTo create a new user, just click on the `Create new user` button. \nYou will have some informations to fill :\n\n* User's name\n* User's email adress\n* Possibly user's avatar. It could be an URl or an assets from the object manager\n* Activate / deactivate the admin status\n* User's password\n* User's personal token (usefull for integration apis)\n* The tenants which are accessible to the user\n* Metadata\n\nTo finalize the creation, click on the `Create` button.\n\n## Remove User\n\nTo delete a user, just hover the avatar and click on `Delete` button (bin icon). Finaly, confirm the command.\n\n## Impersonate user\n\nDaikoku provides users impersonation. Just hover over the avatar and click on `impersonate` button (ninja icon)."
  },
  {
    "name": "3-sessions.md",
    "id": "/adminusage/3-sessions.md",
    "url": "/adminusage/3-sessions.html",
    "title": "Managing sessions",
    "content": "# Managing sessions\n\nWith Daikoku, you can manage connected users' sessions and you can discard sessions whenever you want. Sessions last 24h by default and you can customize them with tenant authentication information @ref:[tenant config.](./1-tenants.md)\n\n## Admin. sessions\n\nTo see last current admin session on Daikoku from the UI, go to `settings (avatar icon) / Organizations settings` and then `User sessions`. You can discard individual sessions or all sessions at once using `Delete` button (trash icon) or `Delete all sessions` button.\n"
  },
  {
    "name": "4-importexport.md",
    "id": "/adminusage/4-importexport.md",
    "url": "/adminusage/4-importexport.html",
    "title": "Import and export",
    "content": "# Import and export\n\nWith Daikoku, you can easily save the current state of the instance and restore it later. Go to `Settings (avatar icon) / Organizations settings` and then `import/export`.\n\n## Full export\n\nClick on the `download state` button.\n\nYour browser will start downloading a ndjson file containing the internal state of your Daikoku instance.\n\n> Audit trail store could be massive, you can exclude this collection from export by toggle the button below the `download state` button.\n\n## Full import\n\nIf you want to restore an export, Go to `settings (avatar icon) / Organizations settings` and then `import/export`.  Click on the `import state` button and choose your ndjson export file.\n\n## Database migration\n\nSince v1.1.1 Daikoku support postgresql database. If you want to migrate you mongoDB to postgresql, it's dead simple like :\n  1. add your postgresql access in daikoku configuration\n  2. keep mongo as daikoku.storage configuration\n  3. run the migration\n  4. update your daikoku.storage to postgres\n  5. restart your Daikoku\n  6. remember to disable the maintenance mode\n"
  },
  {
    "name": "index.md",
    "id": "/adminusage/index.md",
    "url": "/adminusage/index.html",
    "title": "Using Daikoku as Daikoku admin",
    "content": "# Using Daikoku as Daikoku admin\n\nNow we will see how to use Daikoku as Daikoku admin.\n\n@@@ index\n\n* [managing tenants](./1-tenants.md)\n* [managing users](./2-users.md)\n* [managing sessions](./3-sessions.md)\n* [import and export](./4-importexport.md)\n\n@@@\n"
  },
  {
    "name": "apis.md",
    "id": "/apis.md",
    "url": "/apis.html",
    "title": "Admin REST API",
    "content": "# Admin REST API\nDaikoku provides a fully featured REST admin API to perform almost every operation possible in the Daikoku dashboard.\n\n## OpenAPI descriptor\n\nThe Daikoku admin API is described using OpenAPI format and is available at :\n\nhttps://maif.github.io/daikoku/manual/code/swagger.json\n\n## OpenAPI definition as UI\n\nYou can read the OpenAPI definition in a more human friendly fashion using `Swagger UI`. The swagger UI documentation of the Daikoku admin API is available at :\n\nhttps://maif.github.io/daikoku/swagger-ui/index.html\n\nEvery Daikoku instance provides its own embedded OpenAPI descriptor at :\n\nhttp://daikoku.oto.tools:8080/api/swagger/ui\n\nAdmin API OpenAPI descriptor is also accessoble in admin API page in UI, in the `Api Reference` tab.\n\nYou can also read the swagger UI documentation of the Daikoku admin API below :\n\n@@@ div { .swagger-frame }\n\n\n@@@"
  },
  {
    "name": "archi.md",
    "id": "/archi.md",
    "url": "/archi.html",
    "title": "Architecture",
    "content": "# Architecture\n\nTo make Daikoku works, you'll need an [Mongodb](https://www.mongodb.com/) (used by default) or an [Postgres](https://www.postgresql.org/) datastore and an emailing provider ([Mailgun](https://www.mailgun.com/) and [Mailjet](https://www.mailjet.com/) are supported). Tou can also export the audit trail of Daikoku using many techniques with webhooks, a [Kafka](https://kafka.apache.org/) topic or an [elastic cluster](https://www.elastic.co/fr/products/elasticsearch).\n\nAs you can see, Daikoku is capable of working with many [Otoroshi](https://maif.github.io/otoroshi) cluster instances to handle all the use cases of exposing APIs. Daikoku will **never** interact directly with your APIs.\n\n@@@ div { .centered-img }\n<img src=\"./img/daikoku-architecture.png\" />\n@@@\n"
  },
  {
    "name": "1-subscribe.md",
    "id": "/consumerusage/1-subscribe.md",
    "url": "/consumerusage/1-subscribe.html",
    "title": "Subscribe to an api",
    "content": "# Subscribe to an api\n\n## Choose a plan\nFirst of all, you need to choose an API to subscribe. In the information page of the API, select the `Plans` tab.\nhere are presented the differents pricing plans of the api (if team decides to present multiple plans).\nJust click the `subscribe` button. If you are member of several teams, please choose teams to make subscription and click the `subscribe` button.\n\nIf the plan has no process of subscription, a green message appears to inform you that the subscription is successful.\notherwise, the process is followed step by step until the subscription is generated (it could take a few moment).\n\n### Payment Process\n\nWhen a user reaches the payment step in the subscription process, Daikoku facilitates the transition to the payment gateway to collect payment information and process the transaction. Here's how it works:\n\n  1.** Redirect to the checout page**: The user is automatically redirected to a secure payment page, where they can enter their payment information, such as credit card details.\n\n  2. **Payment Information Handling**: Daikoku does not store user payment information. All payment details are collected directly by the payment gateway, ensuring the security of sensitive data.\n\n  3. **Transaction Processing**: th epayment gateway processes the transaction using the payment information provided by the user. Once the transaction is successfully validated, Daikoku receives a payment confirmation notification.\n\n  4. **Subscription Validation**: After payment validation, Daikoku marks the subscription as approved in the system. The user is then redirected to the Daikoku homepage, where they can start using the subscribed API features.\n\n> If a user has already subscribed via th epayment gateway, his team and information will be retrieved because they are associated with their Daikoku IDs.\n\n## Fast mode\nDaikoku offers a fast mode to display, for a selected team, only accessibles APIs (and subscriptions plans with their informations). In this UI, you can subscribe to all plan without switching pages and get subscription credentials.\n"
  },
  {
    "name": "2-apikeys.md",
    "id": "/consumerusage/2-apikeys.md",
    "url": "/consumerusage/2-apikeys.html",
    "title": "Manage APIkeys",
    "content": "# Manage APIkeys\nIn the backoffice team, click on the `API keys` entry, on the left.\nAnd you should see the list of subscribed `APIs`\n\n## View APIkeys\nOn the right of the API line, click on the `API Keys` button.\nAll subscribed plan for the API are displayed.\n\nfirst of all, you can rename your API key, it's just for better reading\n\n - Secret can be reseted for an API key\n - API key usage statistics are avalaible after clicking on the `stats` button.\nStats are avalaible for `today`, `yesterday`, `last week`, `last month` or `the billing period`.\nYou can see a graph to see usage or some global informations likes hits count, average duration or average overhead.\n - To copy credentials, click on the `copy` button at the bottom right of the component.\n - APIkey Rotation can be enabled and setup (by choosing rotation period and grace period)\n - APIkey can be enabled or disabled\n - The subscription provide integration token in addition to the APIkey. This token could be used to avoid to display APIKey and must be considered as a reference to the APIKey. Daikoku provide an api to get credentials from integration token, please read the OpenAPI definition for more information.\n \nEvery subscription have an integration token, which make credentials accessible by admin api. This token is visible in integration token tab.\n\n## View global statistics\nAfter clicking on the `Global stats` button, global statistics are displayed.\nIt's a view of your usage by APIs, split by APIkeys."
  },
  {
    "name": "3-aggregation-of-apikeys.md",
    "id": "/consumerusage/3-aggregation-of-apikeys.md",
    "url": "/consumerusage/3-aggregation-of-apikeys.html",
    "title": "Use an api key on multiple apis",
    "content": "# Use an api key on multiple apis\n\nBy default, the api keys, generated from Daikoku, can't be used on multiple plans.\nIf this feature is enable for the tenant and the API, the `request api key` button will prompt a choice : subscribe with a new api key or subscribe using an existing api key.\n\nWhen the rights of an api key is extended, you can visualize the link between root api key and the children \"extended\" api keys, directly in the api keys view."
  },
  {
    "name": "4-billing.md",
    "id": "/consumerusage/4-billing.md",
    "url": "/consumerusage/4-billing.html",
    "title": "Team billing",
    "content": "# Team billing\n\nTeam billing page is basically the same view than @ref:[Team income](../producerusage/4-income.md) with consumer point of view.\n\n\n> If your subscription is associated to a payment gateway, you can modify certain billing information, such as your name, address, and payment details via the billing information modification page, stored by the payment gateway. This page is accessible by a link diplayed on each subscription information in this page.\n"
  },
  {
    "name": "5-fastmode.md",
    "id": "/consumerusage/5-fastmode.md",
    "url": "/consumerusage/5-fastmode.html",
    "title": "Fast mode",
    "content": "# Fast mode\n\nThe fast mode page allows for API key requests to be made more quickly.\n\nFirst, it is necessary to select a team for which a request is desired, then the process can be facilitated by using a filtering system. Only the APIs that are visible to the team are displayed.\n\nFinally, additional information about a plan can be displayed by clicking above, and the API keys can be viewed by clicking the \"view API keys\" button."
  },
  {
    "name": "index.md",
    "id": "/consumerusage/index.md",
    "url": "/consumerusage/index.html",
    "title": "Using Daikoku as api consumer",
    "content": "# Using Daikoku as api consumer\n\nNow we will see how to use Daikoku for basic tasks that will be useful for your day to day work with Daikoku as consumer.\n\n\n@@@ index\n\n* [Subscribe api](./1-subscribe.md)\n* [Managing apikeys](./2-apikeys.md)\n* [Aggregation of api keys](./3-aggregation-of-apikeys.md)\n* [Team billing](./4-billing.md)\n* [Fast Mode](./5-fastmode.md)\n\n@@@\n"
  },
  {
    "name": "index.md",
    "id": "/deploy/index.md",
    "url": "/deploy/index.html",
    "title": "Deploy to production",
    "content": "# Deploy to production\n\nNow it's time to deploy Daikoku in production, in this chapter we will see what kind of things you can do.\n\n## Deploy with Docker\n\nDaikoku is available as a Docker image on DockerHub so you can just use it in any Docker compatible environment\n\n```sh\ndocker run -p \"8080:8080\" maif/daikoku\n```\n\nYou can also pass useful args like :\n\n```\ndocker run -p \"8080:8080\" daikoku -Dconfig.file=/usr/app/daikoku/conf/daikoku.conf -Dlogger.file=/usr/app/daikoku/conf/daikoku.xml\n```\n\nIf you want to provide your own config file, you can read @ref:[the documentation about config files](../firstrun/configfile.md).\n\nYou can also provide some ENV variable using the `--env` flag to customize your Daikoku instance.\n\nThe list of possible env variables is available @ref:[here](../firstrun/env.md).\n\nYou can use a volume to provide configuration like :\n\n```sh\ndocker run -p \"8080:8080\" -v \"$(pwd):/usr/app/daikoku/conf\" maif/daikoku\n```\n\nYou can also use a volume if you choose to use exports files :\n\n```sh\ndocker run -p \"8080:8080\" -v \"$(pwd):/usr/app/daikoku/imports\" maif/daikoku -Ddaikoku.init.data.from=/usr/app/daikoku/imports/export.ndjson\n```\n\n## Deploy manually\n\nAs Daikoku is a PlayFramwork application, you can follow the [PlayFramework documentation](https://www.playframework.com/documentation/2.6.x/Production) to deploy your application.\n"
  },
  {
    "name": "configfile.md",
    "id": "/firstrun/configfile.md",
    "url": "/firstrun/configfile.html",
    "title": "Config. with files",
    "content": "# Config. with files\n\nThere are a lot of things you may configure in Daikoku. By default, Daikoku provides a configuration that should be enough for testing purpose. But you'll likely need to update this configuration when you'll need to move Daikoku into production.\n\nIn this page, any configuration property can be set at runtime using a `-D` flag when launching Daikoku like :\n\n```sh\njava -Dhttp.port=8080 -jar daikoku.jar\n```\n\nor\n\n```sh\n./bin/daikoku -Dhttp.port=8080\n```\n\n## Common configuration\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.mode`|String|\"prod\"| Daikoku running mode. Supported values are `dev` or `prod` |\n|`daikoku.exposedOn`|String|http.port| the http port exposed by Daikoku  |\n|`daikoku.singingkey`|String|\"secret\"| the secret used for signing the JWT token |\n|`daikoku.tenants.provider` | string | \"local\" | the way to get the tenant to display. Supported values are `local`, `header` or `hostname`|\n|`daikoku.tenants.hostheaderName` | string | Otoroshi-Proxied-Host | the header key to get host, in case of daikoku.tenants.provider is `hostname` |\n|`daikoku.team.defaultApiKeyVisibility`| string | \"User\" | The default value of team apikeys visibility for its own members based on Team permission. Supported values are `Administrator`, `ApiEditor` or `User` |\n|`daikoku.exposition.provider` | string | \"none\" | activate the exchange protocol. Supported values are `otoroshi` (for [Otoroshi Exchange Protocol](https://maif.github.io/otoroshi/manual/usage/2-services.html#otoroshi-exchange-protocol) and `none` |\n|`daikoku.snowflake.seed` | number | 0 | this number will is used to generate unique ids across the cluster. Each Otorshi instance must have a unique seed. |\n\n## Admin api\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.api.type`|String|\"local\"| the provider of apikey for admin apis. Supported values are `local` and `otoroshi` |\n|`daikoku.api.key`|String|\"secret\"| the local apikey of admin apis |\n|`daikoku.api.headerName`|String|\"Otoroshi-Claim\"| |\n|`daikoku.api.headerSecret`|String|\"secret\"|  |\n\n## Otoroshi settings\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.exposition.otoroshi.stateHeaderName` | string | \"Otoroshi-State\" | the otoroshi exchange protocol header name |\n|`daikoku.exposition.otoroshi.stateRespHeaderName` | string | \"Otoroshi-State-resp\" | the otoroshi exchange protocol response header name |\n|`daikoku.otoroshi.groups.namePrefix` | string |  | value to filter otoroshi groups based on the group name |\n|`daikoku.otoroshi.groups.idPrefix` | string | | value to filter otoroshi groups based on the group d |\n|`daikoku.otoroshi.sync.master` | boolean | false | value to define if the instance is the master to sync otoroshi datas |\n|`daikoku.otoroshi.sync.key` | string | \"secret\" | sync key to sync otoroshi |\n|`daikoku.otoroshi.sync.cron` | boolean | false | value to define if otorshi values are sync by cron |\n|`daikoku.otoroshi.sync.instance` | number |  | Daikoku instance number |\n\n## Daikoku init\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.init.host`|String|\"localhost\"|  |\n|`daikoku.init.admin.name`|String|\"Super admin\"| Daikoku default admin name |\n|`daikoku.init.admin.email`|String| \"admin@daikoku.io\" | Daikoku default admin email |\n|`daikoku.init.admin.password`|String| |Daikoku default admin password |\n|`daikoku.init.data.from` | string |  | a file path or a URL to a Daikoku export file. If the datastore is empty on startup, this file will be used to import data to the empty DB  |\n\n\n## DB configuration\n\n> Choose database\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.storage` | string | \"postgres\" | You can use mongo or postgres database. mongoDb is deprecated and will be no longer supported in the next major release |\n\n\n> Mongo configuration\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`mongodb.uri` | string | \"mongodb://localhost:27017/daikoku\" | the uri to mongdb datastore |\n\n\n> Postgres configuration\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.postgres.port` | int | 5432 | the port used to connect to datastore |\n|`daikoku.postgres.host` | string | \"localhost\" | the host where datastore is |\n|`daikoku.postgres.database` | string | \"default\" | the name of the database |\n|`daikoku.postgres.username` | string | \"postgres\" | the user used to connect to database |\n|`daikoku.postgres.password` | string | \"postgres\" | the password used to connect to database |\n|`daikoku.postgres.schema` | string | \"public\" | the current schema |\n\n> Audit trail purge configuration\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n|`daikoku.audit.purge.cron` | boolean | false | enable the automatic purge of audit trail in database  |\n|`daikoku.audit.purge.interval` | string | \"1hour\" | The interval of purge run |\n|`daikoku.audit.purge.max.date` | string | \"60days\" | retention date for the audit trail |\n\n## Play specific configuration\n\nAs Daikoku is a [Play app](https://www.playframework.com/), you should take a look at [Play configuration documentation](https://www.playframework.com/documentation/2.6.x/Configuration) to tune its internal configuration\n\n| name | type | default value  | description |\n| ---- |:----:| -------------- | ----- |\n| `http.port` | number | 8080 | the http port used by Daikoku. You can use 'disabled' as value if you don't want to use http |\n| `https.port` | number | disabled | the https port used by Daikoku. You can use 'disabled' as value if you don't want to use https |\n| `play.http.secret.key` | string | \"secret\" | the secret used to sign Daikoku session cookie |\n| `play.http.session.secure` | boolean | false | whether or not the Daikoku backoffice session will be served over https only |\n| `play.http.session.httpOnly` | boolean | true | whether or not the Daikoku backoffice session will be accessible from Javascript |\n| `play.http.session.maxAge` | number | 259200000 | the number of seconds before Daikoku backoffice session expired |\n| `play.http.session.domain` | string | null | the domain on which the Daikoku backoffice session is authorized |\n| `play.http.session.cookieName` |  string | \"daikoku-session\" | the name of the Daikoku backoffice session |\n| `server.https.keyStore.path` |  string |  | the path to the keyStore containing the private key and certificate, if not provided generates a keystore for you |\n| `server.https.keyStore.type` |  string | \"JKS\" | the keyStore type |\n| `server.https.keyStore.password` |  string | \"\" | the password |\n| `server.https.keyStore.algorithm` |  string |  | The keyStore algorithm, defaults to the platforms default algorithm |\n\n\n\n## More config. options\n\nSee https://github.com/MAIF/daikoku/blob/master/daikoku/conf/application.conf\n\nif you want to configure https on your Daikoku server, just read [PlayFramework documentation about it](https://www.playframework.com/documentation/2.6.x/ConfiguringHttps)\n\n## Example of configuration file\n\n```conf\ndaikoku {\n\n  mode = \"prod\"\n  signingKey = \"secret\"\n\n  exposedOn = ${http.port}\n\n  api {\n    type = \"local\"\n    key = \"secret\"\n    headerName = \"Otoroshi-Claim\"\n    headerSecret = \"secret\"\n  }\n\n  init {\n    host = \"localhost\"\n    admin {\n      name = \"Super admin\"\n      email = \"admin@daikoku.io\"\n      password = \"password\"\n    }\n    data {\n      from = \"/config/daikoku.ndjson\"\n      headers = {}\n    }\n  }\n\n  snowflake {\n    seed = 0\n  }\n\n  tenants {\n    provider = \"local\"\n  }\n\n  exposition {\n    provider = \"none\"\n    otoroshi {\n      stateHeaderName = \"Otoroshi-State\"\n      stateRespHeaderName = \"Otoroshi-State-Resp\"\n    }\n  }\n\n  otoroshi {\n    groups {\n      namePrefix = \"daikoku\"\n    }\n    sync {\n      interval = 3600000\n      master = false\n      key = \"secret\"\n      cron = true\n      instance = 0\n    }\n  }\n\n  stats {\n    sync {\n      interval = 3600000\n      cron = true\n    }\n    call {\n      interval = 600000\n    }\n  }\n\n  audit {\n    purge {\n      cron = false\n      interval = 1hour\n      max.date = 60days\n    }\n  }\n}\n\nmongodb {\n  uri = \"mongodb://localhost:27017/daikoku\"\n}\n\n\nhttp.port = 8080\nhttps.port = disabled\n\nplay {\n  application.loader = \"fr.maif.otoroshi.daikoku.DaikokuLoader\"\n  modules {}\n  filters {\n    enabled = []\n  }\n  http {\n    filters = play.api.http.NoHttpFilters\n    secret {\n      key = \"secret\"\n    }\n    session = {\n      cookieName = \"daikoku-session\"\n      secure = false\n      maxAge = 259200000\n      httpOnly = true\n      sameSite = \"lax\"\n      domain = null\n      path = ${play.http.context}\n      jwt {\n        signatureAlgorithm = \"HS256\"\n        expiresAfter = ${play.http.session.maxAge}\n        clockSkew = 5 minutes\n        dataClaim = \"data\"\n      }\n    }\n  }\n  server {\n    akka {\n      requestTimeout = 60s\n    }\n    http {\n      port = ${http.port}\n      idleTimeout = 60s\n    }\n  }\n}\n\n```\n"
  },
  {
    "name": "datastore.md",
    "id": "/firstrun/datastore.md",
    "url": "/firstrun/datastore.html",
    "title": "Choose your audit trail datastore",
    "content": "# Choose your audit trail datastore\n\nDaikoku needs to store its audit trail in a datastore. Daikoku supports multiple datastores. \nIt store its in the main database by default but you can add another one besides. If you are afraid of filling your disk space too quickly, a purge mechanism can be activated thanks to an environment variable daikoku.audit.purge.cron\n\nAvailable datastores for audit trail are the following :\n\n* elastic\n* kafka\n* webhook\n\nYou can manage it in the tenant settings page.\n"
  },
  {
    "name": "env.md",
    "id": "/firstrun/env.md",
    "url": "/firstrun/env.html",
    "title": "Config. with ENVs",
    "content": "# Config. with ENVs\n\nNow that you know @ref:[how to configure Daikoku with the config. file](./configfile.md) every properties in the following block can be overriden by an environment variable (an env. variable is written like `${?ENV_VARIABLE}`).\n\n```\nmode = ${?DAIKOKU_MODE}\nsigningKey = ${?DAIKOKU_SIGNING_KEY}\nexposedOn = ${?DAIKOKU_EXPOSED_ON}\nype = ${?DAIKOKU_API_TYPE}\nkey = ${?DAIKOKU_API_KEY}\nheaderName = ${?DAIKOKU_API_HEADERNAME}\nheaderSecret = ${?DAIKOKU_API_HEADERSECRET}\nhost = ${?DAIKOKU_INIT_HOST}\nname = ${?DAIKOKU_INIT_ADMIN_NAME}\nemail = ${?DAIKOKU_INIT_ADMIN_EMAIL}\npassword = ${?DAIKOKU_INIT_ADMIN_PASSWORD}\nfrom = ${?DAIKOKU_INIT_DATA_FROM}\nseed = ${?INSTANCE_NUMBER}\nprovider = ${?DAIKOKU_TENANT_PROVIDER}\nhostheaderName = ${?DAIKOKU_TENANT_HOST_HEADERNAME}\ndefaultApiKeyVisibility = ${?DAIKOKU_TEAM_DEFAULT_APIKEY_VISIBILITY}\nprovider = ${?DAIKOKU_EXPOSITION_PROVIDER}\nstateHeaderName = ${?DAIKOKU_EXPOSITION_OTOROSHI_STATE_HEADER_NAME}\nstateRespHeaderName = ${?DAIKOKU_EXPOSITION_OTOROSHI_STATE_RESP_HEADER_NAME}\nnamePrefix = ${?DAIKOKU_OTOROSHI_GROUPS_NAME_PREFIX}\nidPrefix = ${?DAIKOKU_OTOROSHI_GROUPS_ID_PREFIX}\nmaster = ${?DAIKOKU_OTOROSHI_SYNC_MASTER}\nkey = ${?DAIKOKU_OTOROSHI_SYNC_KEY}\ncron = ${?DAIKOKU_OTOROSHI_SYNC_CRON}\ninstance = ${?INSTANCE_NUMBER}\ncron = ${?DAIKOKU_OTOROSHI_SYNC_CRON}\nuri = ${?MONGODB_URI}\nuri = ${?MONGODB_ADDON_URI}\nhttp.port = ${?PORT}\nhttps.port = ${?HTTPS_PORT}\nkey = ${?PLAY_CRYPTO_SECRET}\ncookieName = ${?DAIKOKU_SESSION_NAME}\nsecure = ${?DAIKOKU_SESSION_SECURE}\nmaxAge = ${?DAIKOKU_SESSION_MAXAGE}\nhttpOnly = ${?DAIKOKU_SESSION_HTTPONLY}\nsameSite = ${?DAIKOKU_SESSION_SAMESITE}\ndomain = ${?DAIKOKU_SESSION_DOMAIN}\npath=${?HTTPS_KEYSTORE_PATH}\ntype=${?HTTPS_KEYSTORE_TYPE}\npassword=${?HTTPS_KEYSTORE_PASSWORD}\nalgorithm=${?HTTPS_KEYSTORE_ALGO}\nhost = ${?DAIKOKU_POSTGRES_HOST}\nschema = ${?DAIKOKU_POSTGRES_SCHEMA}\ndatabase = ${?DAIKOKU_POSTGRES_DATABASE}\nusername = ${?DAIKOKU_POSTGRES_USERNAME}\npassword = ${?DAIKOKU_POSTGRES_PASSWORD}\nport = ${?DAIKOKU_POSTGRES_PORT}\nstorage = ${?DAIKOKU_STORAGE}\n```\n"
  },
  {
    "name": "index.md",
    "id": "/firstrun/index.md",
    "url": "/firstrun/index.html",
    "title": "First run",
    "content": "# First run\n\nNow that you have your own distro of Daikoku, it's time to run it. \n\nBut before doing so, you'll need to make a few choices about some essential stuff in order to have the version of Daikoku which suits to your needs.\n\nLet's start with the datastore !\n\n@@@ index\n\n* [choose an audit_trail_datastore](./datastore.md)\n* [use custom config file](./configfile.md)\n* [use ENV](./env.md)\n* [initial state](./initialstate.md)\n* [Run](./run.md)\n\n@@@"
  },
  {
    "name": "initialstate.md",
    "id": "/firstrun/initialstate.md",
    "url": "/firstrun/initialstate.html",
    "title": "Import initial state",
    "content": "# Import initial state\n\nNow you are almost ready to run Daikoku for the first time, but maybe you want to import data from previous Daikoku installation in your current datastore.\n\nTo do that, you need to add the `app.init.data.from` setting to the Daikoku configuration (or `$DAIKOKU_INIT_DATA_FROM` env).\n\nIt can be a file path or a URL to the ndjson file.\n"
  },
  {
    "name": "run.md",
    "id": "/firstrun/run.md",
    "url": "/firstrun/run.html",
    "title": "Run Daikoku",
    "content": "# Run Daikoku\n\nNow you are ready to run Daikoku. You can run the following command with some tweaks depending on the way you want to configure Daikoku. If you want to pass a custom configuration file, use the `-Dconfig.file=/path/to/file.conf` option in the following commands.\n\n## From .zip file\n\n```sh\nunzip daikoku-dist.zip\ncd daikoku-vx.x.x\n./bin/daikoku\n```\n\n## From .jar file\n\nFor Java 11\n\n```sh\njava -jar daikoku.jar\n```\n\n## From docker\n\n```sh\ndocker run -p \"8080:8080\" maif/daikoku\n```\n\nYou can also pass useful args like :\n\n```\ndocker run -p \"8080:8080\" daikoku -Dconfig.file=/usr/app/daikoku/conf/daikoku.conf -Dlogger.file=/usr/app/daikoku/conf/daikoku.xml\n```\n\nIf you want to provide your own config file, you can read @ref:[the documentation about config files](../firstrun/configfile.md).\n\nYou can also provide some ENV variable using the `--env` flag to customize your Daikoku instance.\n\nThe list of possible env variables is available @ref:[here](../firstrun/env.md).\n\nYou can use a volume to provide configuration like :\n\n```sh\ndocker run -p \"8080:8080\" -v \"$(pwd):/usr/app/daikoku/conf\" maif/daikoku\n```\n\nYou can also use a volume if you choose to use exports files :\n\n```sh\ndocker run -p \"8080:8080\" -v \"$(pwd):/usr/app/daikoku/imports\" maif/daikoku -Ddaikoku.init.data.from=/usr/app/daikoku/imports/export.ndjson\n```\n\n## Run examples\n\n```sh\n$ java \\\n  -Xms2G \\\n  -Xmx8G \\\n  -Dhttp.port=8080 \\\n  -Ddaikoku.init.data.from=/home/user/daikoku.ndjson \\\n  -Dconfig.file=/home/user/daikoku.conf \\\n  -jar ./daikoku.jar\n\n[info] play.api.Play - Application started (Prod)\n[warn] daikokuEnv - Main dataStore seems to be empty, importing from /home/user/daikoku.conf ...\n[warn] daikokuEnv - Importing from: /home/user/daikoku.ndjson\n[info] p.c.s.AkkaHttpServer - Listening for HTTP on /0:0:0:0:0:0:0:0:8080\n```\n\nIf you choose to start Daikoku without importing existing data, Daikoku will create a new admin user and print the login details in the log.\n\n```sh\n$ java \\\n  -Xms2G \\\n  -Xmx8G \\\n  -Dhttp.port=8080 \\\n  -jar daikoku.jar\n\n[info] play.api.Play - Application started (Prod)\n[warn] DaikokuEnv - Main dataStore seems to be empty, generating initial data ...\n[info] p.c.s.AkkaHttpServer - Listening for HTTP on /0.0.0.0:8080\n[warn] DaikokuEnv -\n[warn] DaikokuEnv - You can log in with admin@daikoku.io / wr4pHmVRArCGhHoteMfwqV6UuvQh6J2z\n[warn] DaikokuEnv -\n[warn] DaikokuEnv - Please avoid using the default tenant for anything else than configuring Daikoku\n[warn] DaikokuEnv -\n\n```\n"
  },
  {
    "name": "frombinaries.md",
    "id": "/getdaikoku/frombinaries.md",
    "url": "/getdaikoku/frombinaries.html",
    "title": "From binaries",
    "content": "# From binaries\n\nIf you want to download the last version of Daikoku, you can grab them from the release page of the Daikoku github page :\n\nGo to https://github.com/MAIF/daikoku/releases and get the last version of the `daikoku-xxx.zip` file or the `daikoku.jar` file.\n"
  },
  {
    "name": "fromdocker.md",
    "id": "/getdaikoku/fromdocker.md",
    "url": "/getdaikoku/fromdocker.html",
    "title": "From docker",
    "content": "# From docker\n\nIf you're a Docker aficionado, Daikoku is provided as a Docker image that your can pull directly from Official repos.\n\nFetch the last Docker image of Daikoku :\n\n```sh\ndocker pull maif/daikoku:16.3.4\n# or \ndocker pull maif/daikoku:latest\n```"
  },
  {
    "name": "fromsources.md",
    "id": "/getdaikoku/fromsources.md",
    "url": "/getdaikoku/fromsources.html",
    "title": "From sources",
    "content": "# From sources\n\nTo build Daikoku from sources, you need the following tools :\n\n* git\n* JDK 11\n* SBT\n* node\n* yarn\n\nOnce you've installed all those tools, go to the [Daikoku github page](https://github.com/MAIF/daikoku) and clone the sources :\n\n```sh\ngit clone https://github.com/MAIF/daikoku.git --depth=1\n```\n\nthen you need to run the `build.sh` script to build the documentation, the React UI and the server :\n\n```sh\nsh ./scripts/build.sh\n```\n\nand that's all, you can grab your Daikoku package at `daikoku/target/scala-2.12/daikoku` or `daikoku/target/universal/`.\n\nFor those who want to build only parts of Daikoku, read the following.\n\n## Build the documentation only\n\nGo to the `documentation` folder and run :\n\n```sh\nsbt ';clean;paradox'\n```\n\nThe documentation is located at `documentation/target/paradox/site/main/`\n\n## Build the React UI\n\nGo to the `daikoku/javascript` folder and run :\n\n```sh\nyarn install\nyarn webpack:build\n```\n\nYou will find the JS bundle at `daikoku/public/react-app/daikoku.js`.\n\n## Build the Daikoku server\n\nGo to the `daikoku` folder and run :\n\n```sh\nsbt ';clean;compile;dist;assembly'\n```\n\nYou will find your Daikoku package at `daikoku/target/scala-2.12/daikoku` or `daikoku/target/universal/`.\n"
  },
  {
    "name": "index.md",
    "id": "/getdaikoku/index.md",
    "url": "/getdaikoku/index.html",
    "title": "Get Daikoku",
    "content": "# Get Daikoku\n\nThere are several ways to get Daikoku to run it on your system.\n\nLet's start with a good old build from sources :)\n\n@@@ index\n\n* [from sources](./fromsources.md)\n* [from binaries](./frombinaries.md)\n* [from docker](./fromdocker.md)\n\n@@@"
  },
  {
    "name": "index.md",
    "id": "/index.md",
    "url": "/index.html",
    "title": "Daikoku",
    "content": "# Daikoku\n\n**Daikoku** is the developer portal which was missing for Otoroshi. It is written in <a href=\"https://www.scala-lang.org/\" target=\"_blank\">Scala</a> and developped by the <a href=\"https://maif.github.io\" target=\"_blank\">MAIF OSS</a> team.\nSince the v1.5, Daikoku & Otoroshi share the same Major & Minor version, so, please use the same version of Otoroshi as Daikoku for a better experience.\n\n\n> *In Japan, <a href=\"https://en.wikipedia.org/wiki/File:Daikoku.jpg\" target=\"blank\">Daikokuten</a> (大黒天), the god of great darkness or blackness, or the god of five cereals, is one of the Seven Lucky Gods (Fukujin). Daikokuten evolved from the Buddhist form of the Indian deity Shiva intertwined with the Shinto god Ōkuninushi. The name is the Japanese equivalent of Mahākāla, the Hindu name for Shiva.*\n\n@@@ div { .centered-img }\n[![Build](https://github.com/MAIF/daikoku/workflows/Build/badge.svg)](https://travis-ci.org/MAIF/daikoku) [![Join the chat at https://gitter.im/MAIF/daikoku](https://badges.gitter.im/MAIF/daikoku.svg)](https://gitter.im/MAIF/daikoku?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge) [ ![Download](https://img.shields.io/github/release/MAIF/daikoku.svg) ](https://github.com/MAIF/daikoku/releases/download/v16.3.4/daikoku.jar)\n@@@\n\n@@@ div { .centered-img }\n<img src=\"https://github.com/MAIF/daikoku/raw/master/resources/daikoku-logo.png\" width=\"300\"></img>\n@@@\n\n@@@ warning { title='New to Otoroshi ?' }\nYou are not sure of what is **Otoroshi**, you should probably have a look at [this](https://maif.github.io/otoroshi/manual/quickstart.html) first.\n@@@\n\n## Installation\n\nYou can download the latest build of Daikoku as a [fat jar](https://github.com/MAIF/daikoku/releases/download/v16.3.4/daikoku.jar) or as a [zip package](https://github.com/MAIF/daikoku/releases/download/v16.3.4/daikoku-16.3.4.zip).\n\nYou can install and run Otoroshi with this little bash snippet :\n\n```sh\ncurl -L -o daikoku.jar 'https://github.com/MAIF/daikoku/releases/download/v16.3.4/daikoku.jar'\njava -jar daikoku.jar\n```\n\nor using docker :\n\n```sh\ndocker run -p \"8080:8080\" maif/daikoku\n```\n\nNow, open your browser to <a href=\"http://localhost:8080/\" target=\"_blank\">http://localhost:8080/</a>, **log in with the credential generated in the logs** and explore **Daikoku** by yourself\n\n## Documentation\n\n\n## Discussion\n\nJoin the [Daikoku](https://gitter.im/MAIF/daikoku) channel on the [MAIF Gitter](https://gitter.im/MAIF).\n\n## Sources\n\nThe sources of Daikoku are available on [Github](https://github.com/MAIF/daikoku).\n\n## Logo\n\nYou can find the official Daikoku logo [on GitHub](https://github.com/MAIF/daikoku/blob/master/resources/daikoku-logo.png). The Daikoku logo has been created by François Galioto ([@fgalioto](https://twitter.com/fgalioto)).\n\n## Changelog\n\nEvery release, along with migration instructions, is documented on the [Github Releases](https://github.com/MAIF/daikoku/releases) page.\n\n## Patrons\n\nThe work on Daikoku was funded by <a href=\"https://www.maif.fr/\" target=\"_blank\">MAIF</a> with the help of the community.\n\n## Licence\n\nDaikoku is Open Source and available under the [Apache 2 License](https://opensource.org/licenses/Apache-2.0).\n\n@@@ index\n\n* [About Daikoku](about.md)\n* [Architecture](archi.md)\n* [Quickstart](quickstart.md)\n* [Get Daikoku](getdaikoku/index.md)\n* [First run](firstrun/index.md)\n* [Setup](setup/index.md)\n* [Using Daikoku as admin](adminusage/index.md)\n* [Using Daikoku as tenant admin](tenantusage/index.md)\n* [Using Daikoku as API producer](producerusage/index.md)\n* [Using Daikoku as API consumer](consumerusage/index.md)\n* [Integrations API](integrations.md)\n* [Admin REST API](apis.md)\n* [Deploy to production](deploy/index.md)\n\n@@@\n"
  },
  {
    "name": "integrations.md",
    "id": "/integrations.md",
    "url": "/integrations.html",
    "title": "#Integrations API",
    "content": "#Integrations API\n\nDaikoku provides some integrations API accebile by tenant admins to get some values as JSON.\nTo have more informations, all integration APIs are detailed on the @ref:[OpenAPI definition](./apis.md)."
  },
  {
    "name": "1-apis.md",
    "id": "/producerusage/1-apis.md",
    "url": "/producerusage/1-apis.html",
    "title": "Managing APIs",
    "content": "# Managing APIs\n\n## Create a new API\nTo create a new API, you can click on the `+ API` button in the catalog page or the `Create new API` button in the Team's APIs page in your back offices' team.\nAfter clicking on the button localized in the catalog page, you need to choose a team which is the owner.\n\n### API informations\nAn API needs a name to be created.\nThen, you can add a small description, which will be displayed in the corresponding catalog's page.\nThe API can be published or not. In the latter case, you can consider this as a draft.\nAn image can be provide for the \"card view\" of the Api list page.\nto go further in customization of Daikoku, the header of frontebd page of all APIs can be customized by HTML\n> To keep the title and the description use {{title}} and {{description}} in your template. You can add a button with the `btn-edit` classname to add a direct link to API backoffice for your team members.\n\n### Versions and tags\nVersionning your API is supported. You can update the current version of your API.\n@@@warning\nMake sure that your main version is toggle as `use as last version` to be sure the link in the API list redirect to the correct version of your API.\n@@@\nSupported versions are pure information for your users.\nTags and categories are array of item, mostly used to filter APIs.\n\n### Visibililty\nVisibility can be:\n\n* public: everybody can see the complete API.\n* public with authorization: everybody sees just a part of the API, on the catalog's page (name, tags, categories and small desc.). Everybody can ask access to an admin of owner team.\n* private: Just authorized teams have access to the API.\n\n### Authorizations\nThe teams which have access to the API, in the case of visibility is private.\n\n### Description\nAPI description. Basically it can be written in markdown but you can use HTML.\nThe description can be set from team asset.\n\n### Plans\nAn API needs a plan to be subscribed.\nPlan needs a name, possibly a description and an @ref:[otoroshi instance](../tenantusage/1-otoroshi.md).\n\nYou can define a plan as **default plan** as it's possible to **make it private** (only accessible by the producer team)\nIt's possible to **allow multiple API keys** for a plan (by default a team can only have one API key).\nIt's possible to **allow API keys aggregation**\n\nIt's important to choose a type of plan :\n\n* **free without quotas**: a plan with an unlimited number of calls per day and per month.\n* **free with quotas**: a plan with a limited number of calls per day and per month. Quotas will be set by default and can be overwritten.\n* **quotas with limit**: a priced plan with a limited number of calls per day and per month. Quotas will be set by default but can be overwritten. A fixed cost by month can be set. \n* **quotas without limit**: a priced plan with unlimited number of calls per day and per month. Quotas will be set by default but can be overwritten. A fixed cost by month can be set. The cost per additional requests can be set.\n* **pay per use**: a plan priced on usage. A fixed cost by month can be set. The cost per additional requests can be set.\n\nThe subscription process in Daikoku offers flexibility, allowing users to customize their validation steps. There are three possible types of steps:\n\n  * **Admin Validation**: This step requires an administrator from the AP I's owning team to validate the subscription request. When a request is submitted, all administrators in the team receive a Daikoku notification and an email containing the request details. The first administrator who validates the notification approves the step.\n> it's possible to configure this step to display a specific form when user ask subscription.\n> to parameter the form, we use the json language use by [@maif/react-forms](https://github.com/MAIF/react-forms#maifreact-forms).\n> You can write a formatter to format the form response as a notification sended to admins. it's just a string with a replacement pattern like this `[[label]]`\n> the result of the form is used to automatically generate metadata which will be deleteable or modifiable before validation by the admin\n\n  * **HTTP Request**: This step is a semi-automatic step. A http POST is sended to an API with the whole context of the subscription demand\nA json response is awaited with a precise format.\n> a property `accept` as boolean to accept or reject the subscription demand\n> it totally possible to calculate and give some metadata or custom property for the subscription to created\n> ```json\n> {\n>   \"accept\": true,\n>   \"customMaxPerDay\": 42,\n>   \"customMaxPerSecond\": 42,\n>   \"customMaxPerMonth\": 42,\n>   \"customMetadata\": {\n>     \"value1\": 2,\n>     \"value2\": true,\n>     \"value3\": \"foo\"\n>   },\n>   \"adminCustomName\": \"foo-bar-apikey\",\n>   \"customReadOnly\": true\n> }\n> ```\n> the body of the call contains lot of data as the context:  the subscription demand with the other step information, the api, the usage plan, the team and the aggragation in case of an aggergated apikey\n> ```json\n> {\n>   \"demand\": {},\n>   \"api\": {},\n>   \"plan\": {},\n>   \"team\": {},\n>   \"aggregate\": {\n>     \"parent\": {\n>       \"api\": {},\n>       \"plan\": {},\n>       \"subscription\": {} \n>     },\n>     \"subscriptions\": [\n>       {\n>         \"api\": {},\n>         \"plan\": {},\n>         \"subscription\": {} \n>       }\n>     ]\n>   } \n> }\n> ```\n\n  * **Email Validation**: This step involves a third-party person validating the subscription request by clicking on a validation link sent to the provided email address. Once the person clicks on the link, the request is validated, and the user is redirected to a public acknowledgment interface.\n\n  * **Payment Validation**: This step requires the requester to make a payment through a payment gateway. The user is redirected to a payment page provided by the payment gateway where they need to enter their payment information. Once the payment is validated, the subscription is approved, and the user is redirected to Daikoku's home page.\n\n> When a consumption plan for an API is priced, after its creation, one or more Stripe products are created based on the plan type:\n> \n>  **Quotas Only**: A fixed-price subscription product is created.\n> \n> **Quotas / Pay Per Use**: Two products are created: a fixed-price subscription and a variable component linked to the user's consumption, which is synchronized with Stripe at the end of each day.\n> \n> **Pay Per Use**: Similarly, two products are created: a fixed-price subscription and a variable component linked to the user's consumption.\n\n\n@@@warning\nPlease note that the email validation step can be used multiple times, while the other steps can only be completed once in the process.\n@@@warning\n\nThe subscription process can be customized by adding new steps based on specific requirements. \n>Daikoku is an open-source project, and we encourage community initiatives to contribute new step types. We invite contributors to submit Pull Requests on the [project's GitHub repository](https://github.com/MAIF/daikoku) to propose new features.\n\nTo visualize and customize the subscription process, you can access the \"Process\" tab from the plan modification page. From this tab, you can view the entire process, add new steps, modify existing ones, or delete steps. \n\n@@@warning\nPlease be aware that modifying or deleting a step immediately affects ongoing requests, either modifying them or validating them if necessary.\n@@@\n\nWhen submitting a subscription request, the only required data is the team for which you want to subscribe. The subscription process may also prompt you to provide a motivation, particularly if the admin validation step is included. In such cases, a modal window appears to allow for detailed motivation for the request.\n\nOnce the subscription request is validated or declined, notifications and emails are generated to inform the user of the request's status.\n\nIf your subscription plan is associated with consumption-based pricing, you can also modify certain billing information, such as your name, address, and payment details. The link to the billing information modification page, stored by the payment gateway, can be found on Daikoku's billing page.\n\n#### Otoroshi, billing and security\nDepending on chosen plan type, certain custom properties may be accessibles.\n\n- Plan needs an Otoroshi instance to allow users to subscribe. After choosing an instance, a list of Otoroshi service groups and services is accessible to link daikoku api/plan with one or more Otoroshi service group or services.\n- As it's Otoroshi which manages apis, apikey quotas can be define.\n- Daikoku provide, like [Otoroshi](https://maif.github.io/otoroshi/manual/entities/apikeys.html), some apikey parameters.\n- Daikoku side, billing informations can be filled (billing period, cost per month, currency ...)\n- For security, you can force apikey rotation. it's an Otoroshi feature that will reset clientSecret every month with a grace period of 1 week (during this week both secrets works)\n- You can force the integration process :\n  * ApiKey: subscribers have access to an apikey to call api\n  * Automatic: Subscribers have just access to a token, which link to a real apikey, accessible by admin api. It's a perfect solution to integrate automatically your apikey in your prod environment if rotation is activated.\n\n@@@ note { title='API key Metadata' }\nAs Otoroshi does, it's possible to add metadata on API keys. __Automatic metadata__ will be calculated and added after subscription validation. __Asked metadata__ will switch the plan subscription mode to manual then, on susbcription acceptation, a team admin will have to add the metadata manually. \n@@@\n\n### OpenAPI definition\nThe OpenAPI definition can be provided as a url or just some content paste on the UI.\nan additional configuration allow to \n\n### Testing\n\nYou can enable the testing for your API.\n\n> The testing is based on the openAPI definition of your API. Beware of set up the right host of your testing service.\n\nClick on the `Generate a dedicated testing key in Otoroshi` to choose an otoroshi instance and and service group or service which is used to receive the testing APIkey. Then, just follow the instruction display on UI?\n\n#### Configure your openAPI\n\nYour openAPI have to be configured to accept apikey from Basic authentication header or from the `Otoroshi-Client-Id` and `Otoroshi-Client-Secret` headers.\n\nIf you had changed the Otoroshi headers to pass the apikey don't forget to apply the changes on your openAPI.\n\n```json\n...\npaths:\n  /api/_verify:\n    get:\n      summary: Verification using query params\n      operationId: getVerify\n      ...\n      security:\n      - basicAuth: []\n      - otoClientId: []\n        otoClientSecret: []\ncomponents:\n  schemas:\n  securitySchemes:\n    basicAuth:\n      type: http\n      scheme: basic\n    otoClientId:\n      type: apiKey\n      name: Otoroshi-Client-Id\n      in: header\n    otoClientSecret:\n      type: apiKey\n      name: Otoroshi-Client-Secret\n      in: header\n```\n\n\n\n@@@warning\nMake sure this service descriptor is the right one for testing and not your production system !\n@@@\n\n### Documentation\nThe documentation tabs allows you to create a paginated documentation. Like description every pages can be written with markdown or set from asset.\n\n## Manage subscription\n\nOn the team APIs screen on your team back office, it's possible to manage for every APIs its subscriptions by clicking on the `key` button.\nYou can activate/deactivate API keys or update metadata.\n\n## Api consumptions\nOn the team APIs screen on your team back office, it's possible to see for every APIs consumptions by clicking on the `stats` button. Global stats by default but visible by API key or usage plan."
  },
  {
    "name": "2-members.md",
    "id": "/producerusage/2-members.md",
    "url": "/producerusage/2-members.html",
    "title": "Managing teams",
    "content": "# Managing teams\n\n### Create a new Team\n\nIn the home page, on the \"Your Teams\" component, click on the \"+\" button tio open a modal to create a new Team.\nIt's necessary to fill in the following fields :\n\n* Name: the public name of the the new team (it must be unique for the tenant)\n* Description: A quick description for the new team (Display in the all team page)\n* Team contact: the mail to contact the team\n* Team avatar: a link to the team avatar. It's possible to use gravatar (or an asset, once the team is created)\n* apiKeyVisibility: Minimum member permission to see and manage team apikeys. Default set to User.\n\nAfter creation, you will be redirected to the members page to managing them \n\n# Managing team members\nIn the backoffice team, click on the `Setting/Members` entry, on the left.\n\n### Add a new member\nSimply click on `Invit a collaborator` button and then fill with his email. He will be notified that you want to add him to your team. You can see him in the \"pending\" tab, once he accept the invitation he'll appear on the members tab.\nYou will be notified as soon as he accepts or refuses the invitation.\n\n### Remove a member\nHover over member's avatar and click on the `delete` button.\n\n### Update member permission\nHover over member's avatar  and click on the `manage permissions` button.\nThen, choose:\n\n* admin: member can access everything.\n* api editor: member can't manage team but can create an api.\n* nothing: member can just subscribe another team api."
  },
  {
    "name": "2-subscriptions.md",
    "id": "/producerusage/2-subscriptions.md",
    "url": "/producerusage/2-subscriptions.html",
    "title": "#Managing API subscription",
    "content": "#Managing API subscription\n\nTeam administrator can access to all API subscriptions by clicking on the `key` action on the table in team APIS page of your team back office.\n\n##Enable or Disable Apikeys\nBy clicking on the switch button of the `enabled` column, the subscription can be toggled and enabled/disable Otoroshi apikey.\n\n##Update Apikey properties\nOn the `Actions` column, the `Update metadata` button open a modal with a form\n* mandatory metadata: it's the plan `custom metadata` which are only be filled by an admin \n* additional metadata: Some non mandatory/automatic metadata\n* Custom Quotas: If you want override plan quotas for an apikey\n* Other custom props: \n  * read only: the Otoroshi API key can just call API with GET verb\n\n##Refresh subscription secret\nBy clicking on the `refresh` button, a new client secret will be generated and wil replace the Otoroshi client-secret immediately.\nThe subscription team admins will be informed by nootification and mail about the secret refresh."
  },
  {
    "name": "3-assets.md",
    "id": "/producerusage/3-assets.md",
    "url": "/producerusage/3-assets.html",
    "title": "Managing team assets",
    "content": "# Managing team assets\n\nIn the backoffice team, click on the `Team assets` entry, on the left, you should see the list of existing `assets`\n\n@@@ warning\nIf a `Something went wrong !!!` message is displayed, look a the @ref:[Tenant / Bucket configuration](../adminusage/1-tenants.md)\n@@@\n\n## Add a new assets\nSelect a file after click toh the `Select file` button, then the filename, title and content-type should be pre-filled.\nYou can overwrite these informations and add a description if you want.\nClick to the `Add asset` button to finalize the action.\nThis asset can be just used for this team."
  },
  {
    "name": "4-income.md",
    "id": "/producerusage/4-income.md",
    "url": "/producerusage/4-income.html",
    "title": "Team earnings",
    "content": "# Team earnings\n\nIn the backoffice team, click on the `Team Billing/Team income` entry, on the left.\nAnd you should see the list of the `team income`.\n\nEarnings are calculated by month and could be synchronized with otoroshi if data's not fresh.\n\nThe total earnings by month is display on top right of the board and below, you can see the total by API.\nAfter clicking on a api income, you can see the division by apikeys."
  },
  {
    "name": "index.md",
    "id": "/producerusage/index.md",
    "url": "/producerusage/index.html",
    "title": "Using Daikoku as api producer",
    "content": "# Using Daikoku as api producer\n\nNow we will see how to use Daikoku for basic tasks that will be useful for your day to day work with Daikoku.\n\n\n@@@ index\n\n* [manage apis](./1-apis.md)\n* [manage API subscription](./2-subscriptions.md)\n* [manage teams and members](./2-members.md)\n* [manage assets](./3-assets.md)\n* [team income](./4-income.md)\n\n@@@\n"
  },
  {
    "name": "quickstart.md",
    "id": "/quickstart.md",
    "url": "/quickstart.html",
    "title": "Try Daikoku in 5 minutes",
    "content": "# Try Daikoku in 5 minutes\nwhat you will need :\n\n* Docker\n* Docker-Compose\n* 5 minutes of free time\n\nYou can start a sandboxed environment with the following command : \n\n```sh\ncd demo\ndocker-compose up\n```\n\n## Log into the UI\n\nGo to <a href=\"http://daikoku.oto.tools/\" target=\"_blank\">http://daikoku.oto.tools/</a> and log in with the **following credential** admin@daikoku.io/Pa$$w0rd (The other users have the same password).\n"
  },
  {
    "name": "admin.md",
    "id": "/setup/admin.md",
    "url": "/setup/admin.html",
    "title": "Manage admin users",
    "content": "# Manage admin users\n\n## Create admin user after the first run\n\nAfter using the default super admin to the first connection to Daikoku, it can be a good idea to create a new super admin.\nGo to `settings (avatar icon) / Organizations settings`.\n\n@@@ div { .centered-img }\n<img src=\"../img/main_page_menu.png\" />\n@@@\n\nGo to the `Users` page, \nyou will see the list of registered users : \n\n@@@ div { .centered-img }\n<img src=\"../img/user_page.png\" />\n@@@\n\n\nNow, you can create a new user. Provide the informations about the admin user you are creating : \n\n@@@ div { .centered-img }\n<img src=\"../img/new_user.png\" />\n@@@\n\nActivate `Daikoku admin.`\nClick on `Create`.\n\nNow, you can log in with the newly created admin adn then delete the initially generated `Super admin`, confirm, and the danger popup will go away.\n\n## Delete admin user\n\nGo to `settings (avatar icon) / Organizations settings / Users`, you will see a list of users that you can discard. \nJust hover the avatar and click on the `Remove User` button (trash icon) and confirm that you actually want to delete an admin user.\n\nYou may also just toggle off the admin status of the user on clicking the `toggle admin status` button (shield icon).\n\n\n"
  },
  {
    "name": "index.md",
    "id": "/setup/index.md",
    "url": "/setup/index.html",
    "title": "Setup Daikoku",
    "content": "# Setup Daikoku\n\nNow that Daikoku is running, you are ready to log into the Daikoku UI and setup your instance. Just go to: <a href=\"http://daikoku.oto.tools:8080\" target=\"_blank\">http://daikoku.oto.tools:8080</a>\n\nYou will see a page to create a new account or connect to an existing account\nNow click on the connect button and you will see the login page\n\n\n@@@ warning\nUse the credentials generated in Daikoku **logs** during **first run**.\n@@@\n\nOnce logged in, the first screen you'll see should be the home page containing only the admin api of your tenant.\n\n@@@ index\n\n* [create admins](./admin.md)\n\n@@@\n"
  },
  {
    "name": "1-otoroshi.md",
    "id": "/tenantusage/1-otoroshi.md",
    "url": "/tenantusage/1-otoroshi.html",
    "title": "Managing Otoroshi instances",
    "content": "# Managing Otoroshi instances\n\nGo to `settings/Organizations settings` and click `Otoroshi instances` on the left menu.\n\nAnd you should see the list of existing `Otoroshi instances`.\n\n## Add a new Otoroshi\n\nClick on the `Create` button.\nA Otoroshi instance is really simple to create. Just fill Otoroshi's url (otoroshi-api URL, not client 😉), the host and credentials (client id and client secret of an API key for Otorshi's admin-api).\n\n## Update an existing instance\n\nTo update an Otoroshi instance, just click the `Update` button (Pen icon). You can modify the otoroshi url, the host or credentials.\n\n## Remove an existing instance\n\nTo delete an Otoroshi instances, just click the `Delete` button (trash icon) and confirm the command."
  },
  {
    "name": "1.5-initialize.md",
    "id": "/tenantusage/1.5-initialize.md",
    "url": "/tenantusage/1.5-initialize.html",
    "title": "Initialize Tenant from Otoroshi instances",
    "content": "# Initialize Tenant from Otoroshi instances\nYou perhaps have a previous instance of Otoroshi, whiche contains services and lot of apikeys. This page have been created to easily import service group as API and apikeys as subscriptions in a tenant of your Daikoku instance.\n\nGo to `settings/Organizations settings` and click `Initialization` on the left menu.\n\nNow, it's easy as just follow steps.\n\n## Select Otoroshi instance\n\nJust select a previously created Otoroshi instance to begin.\n\n## Select the step\n\nYou can begin to import Otoroshi service groups or just Otoroshi apikeys\n\n## Select Service group to import\n\nYou have to choose which services you want to import. It's completly possible to change the API name but no necessary. \nYou have to choose a team to admin the crated API. If the team doesn't exist, you can create a team in this screen.\nYour action is just, for the moment, to tack the api to create, the creation will be effective later.  \n_notice: Every choice you make are saved on your local storage in case of problem._\n\n## Services - Recap and creation\n\nThe next screen list all API to create. If your agree with this, you can click on the `create` button to launch the APIs creation.\n\n## Select API keys to import\n\nYou have to choose which API keys you want to import.\nYou have to choose an API with a plan and a team for every API keys. If the plan does't exists, you can create a plan in this screen (_notice: it will a FreePlan but you can change it after creation_).  \nIf the team doesn't exist, you can create a team in this screen.\nYour action is just, for the moment, to stack the API key to create, the creation will be effective later.  \n_notice: Every choice you make are saved on your local storage in case of problem._\n\n## Subscriptions - Recap and creation\n\nThe next screen list all subscriptions to create. If your agree with this, you can click on the create button to launch the subscriptios creation.\n\n## Done\n\nAll the selected APIs and API keys are created. You have certainly to go to API page to update some informations because APIs are just created with default informations, just name and plan.\nIf you have created some teams, be aware that you are the only member of those teams.\nYou can import APIS and API keys from another Otorshi instance if you wish."
  },
  {
    "name": "2-teams.md",
    "id": "/tenantusage/2-teams.md",
    "url": "/tenantusage/2-teams.html",
    "title": "Managing teams",
    "content": "# Managing teams\n\nGo to `settings/Organizations settings` and then click `teams` on the left menu. You should see the list of existing `teams`\n\n## Add a new team\n\nClick on the `Create` button.\nA team needs the folowing informations :\n\n* Tenant (By default, the current tenant)\n* Name (Name need to be unique for the tenant)\n* Description, a small text to describe the team main page.\n* Team contact, an email address for a simple contact\n* Team avatar, it could be an URl or an asset from the object manager\n* Metadata, some extra informations that will be sent with the api calls with team apikeys\n\n## Update an existing team\nHover over team's avatar and click the `update` button (Pen icon). All the informations filled during the team creation can be overwritten.\n\n## Delete an existing team\n\nHover over team's avatar and click the `delete` button (Bin icon) and confirm the command.\n\n## Manage team members\n\nHover over team's avatar and click the `members` button (Users icons). You will redirect to team's members page.\nYou can refer to the @ref:[managing members](../producerusage/2-members.md)\n\n"
  },
  {
    "name": "3-assets.md",
    "id": "/tenantusage/3-assets.md",
    "url": "/tenantusage/3-assets.html",
    "title": "Managing assets",
    "content": "# Managing assets\n\nGo to `settings/Organizations settings` and then click `Tenant assets` on the left menu, you should see the list of existing `assets`\n\n@@@ warning\nIf a `Something went wrong !!!` message is displayed, look a the @ref:[Tenant / Bucket configuration](../adminusage/1-tenants.md)\n@@@\n\n## Add a new assets\nSelect a file after you click on the `Select file` button, then provide filename, title and content-type should be pre-filled.\nYou can overwrite these informations and add a description if you want to.\nClick to the `Add asset` button to finalize this action.\nThis asset can be used for the tenant and the team (avatar, css file, js file ...)\nYou can get asset's link by clicking le `eye` button or just by copying the button link.\n\n>In the case of font-family, it's advisable to add a query param `streamed=true` to avoid CORS errors.\n\n\n"
  },
  {
    "name": "4-messages.md",
    "id": "/tenantusage/4-messages.md",
    "url": "/tenantusage/4-messages.html",
    "title": "User messages",
    "content": "# User messages\n\nA user can send a message to whole tenant admins. In fact, all members of the tenant admin team can reply to user.\n\nGo to `settings/Organizations settings` and then click `messages` on the left menu, you should see the list of opened conversations. \n\n## reply to message\nIf you receive a new message, conversation  show  you a notification woith the count of unread message. Click on conversation to open message editor and reply to user.\n\n## Close a conversation\nTo close a conversation just click on `trash` button of conversation on the left panel.\nIt's possible to get closed messages on clicking `load previous message` button on the opened conversation.\n\n## Start a new conversation\n\nJust select a user in the selector to start a new  conversation.\n"
  },
  {
    "name": "5-translations.md",
    "id": "/tenantusage/5-translations.md",
    "url": "/tenantusage/5-translations.html",
    "title": "Translate mail content and front office",
    "content": "# Translate mail content and front office\n\nDaikoku supports two languages : french and english (If your language is missing, you can contribute, do not hesitate). All translations can be override when navigating on the `internationalization` page from a tenant settings page (the full route is `https://<your-domain-name>/settings/internationalization/mail`).\n\nOn this page, you have 3 tabs : `Mail`, `Mail Template` and `Front office`.\n\n### Mail\n\nThe mail tab manage all the translations of the mails content. For each translation, you have a list of `required variables` which will be replaced by Daikoku when an email is send\n> Beware of surroound your variable by square brackets if you wants it to be replaced .\n\nFor example, the message \n```\nYour apikey for api [apiName] and plan [planName] have been updated.\n```\n\nhas by default two variable `apiName` and `planName` which will be replace by the name of the api and the name of the plan respectively. \n\n```\nYour apikey for api My First API and plan My first plan have been updated. \n```\n\nEach translation has one field by language. Once a translation is overloaded, a reset button will appear to retrieve the original translation.\n\n### Mail template \n\nAll sent mails are composed of the subject of the mail as body, incorporate in a template. This template can be change and translate in the supported langauges.\n\nWhen you want to change one of these fields, we have to include one `required variable` which is the `email` variable. That variable are replaced by Daikoku, depending on the subject of the email. \n\nIf we take the previous example, without any changes, you should have for an update of api :\n\n```\nYour apikey for api My First API and plan My first plan have been updated. \n```\n\nNow if you want to add a header and a footer at your mail, you have to write in the first field `Default mail template`\n\n```\nHello,\n\n{{email}}\n\nSend from Daikoku.\n```\n\nThe mail will be send with the following content :\n\n```\nHello,\n\nYour apikey for api My First API and plan My first plan have been updated. \n\nSend from Daikoku.\n```\n\n### Front office\n\nDaikoku is a fully customizable user interface that includes the ability to translate the front office (which represents a list of one thousand words).\n\nTo change one expression.\n\n1. Search the expression to change.\n2. Replace the value for your current language.\n3. Click on the save button on your right.\n4. Refresh your page (Daikoku is caching the translations to avoid to fetch the translations in back office each time that needed).\n\n@@@warning\nsome expressions are use in different pages, beware of breaking changes.\n@@@\n\n"
  },
  {
    "name": "5.5-display.md",
    "id": "/tenantusage/5.5-display.md",
    "url": "/tenantusage/5.5-display.html",
    "title": "Display modes",
    "content": "# Display modes\n\nTwo display modes are avalaible in Daikoku\n\n## Default mode\n\nthis is the basic mode of DAikoku, business oriented. The exposed API is only linked to one service and the associated usage plans have only a commercial interest.\n\nThe API carries its documentation, its test configuration or even its OpenAPI definition. The client side of Daikoku offers sections in the API page to display it.\n\n## Environment mode\n\nThe environment mode introduces an approach focused in work environments.\nIt allows users to manage their consumption plans as working environments, better suited for internal corporate use. \nFind out how this feature transforms consumption plan management.\n\n- The usage plans are now working environment\n- The environments contain the tech documentation, the OpenAPI definition and the test config\n- the number envionment for an API is limited to the existing environment of the tenant\n\nto create new environment, just add a new one in the liste below the mode selector \n"
  },
  {
    "name": "6-cms.md",
    "id": "/tenantusage/6-cms.md",
    "url": "/tenantusage/6-cms.html",
    "title": "Using Content Management System",
    "content": "# Using Content Management System\n\nDaikoku provides a way to create a website in front of the backoffice. \n\n@@@warning\nThis feature is only available for public tenants.   \n@@@\n\n## Enable the CMS on your tenant\n\nBy default the CMS is disabled on a private tenant. To turn on the CMS :\n\n1. **Navigate** to your `tenant administration` form\n2. In the `security` section, **disable** the `private tenant` button\n3. **Scroll down** and **enable** the `CMS` in the `Custom home page` section\n\nOnce done, navigate to the domain of your tenant. You have two possiblities :\n\n- you already had a `unlogged home page` on your tenant, so Daikoku automatically created a home page with your previously entered content.\n- you have just started Daikoku, so Daikoku displays an 404 page not found error\n\nIn both cases, you can read the next sections to create your first page and the customize the 404 page.\n\n## Create your first page\n\nIn your tenant administration, **navigate** to the `Pages` tab (visible on the sidebar or available on `https://<your-domain>/settings/pages`)\n\nLet's start by creating the home page.\n\n1. **Click** on the `new page` button\n2. On your left, **tap** the new name of your page (in our example, it will just be `My home page`)\n3. We want to create a page and not a block (read the next section to go deeper into the details). So, let's the `Is a block?` switch disabled\n4. On the `path` field, indicates the path where the page will be showed (in our case, it will be `/`)\n5. On the `Draft` tab, at your center of the screen, edit the `title` and the `h1` of your home page. Add the following tag in the head section `<title>My home page</title>` and rename the content of the `h1` with `My home title page`\n6. Confirm your modifications by **clicking** on the `Publish this version` button (at the right top of your screen).\n\nThe page is created but not already set on your tenant as the home page. **Navigate** to your tenant administration form, to the `Custom home page` and choose your created page in the `Home page` selector.\n\nOnce done, navigate to your domain of your tenant and see your home page appear.\n\n## Custom the 404 page\n\nWhen the CMS cannot find a page for a specific path, it displays a simple Daikoku page error. In many cases, you want to customize and personalize this page with your compagny's graphic charter.\n\n1. Navigate to the `https://<your-domain>/settings/pages`\n2. Create a new page with a name, a path and the desired content \n3. **Publish** the page\n4. Navigate to your tenant administration page\n5. Scroll to the `Custom home page` section\n6. Select the created page in the `404 page` selector\n7. Save your tenant and try to call an invalid cms page : `https://<your-domain>/_/unknown-page`\n\n## Define and use a block\n\nAs a classical CMS, you can create an infinity number of pages but also reusable blocks. A block is composed of the same attributes than a page, with the exception of the path field. Indeed, a block cannot be displayed on a specific route but can be included in the others cms pages.\n\n1. **Create** a new page from the `https://<your-domain>/settings/pages` page\n2. **Activate** the `Is a block?` button\n3. **Publish** your block\n4. **Return** to the list of pages\n5. **Edit** your home page\n6. On the top of the main input, **click** on the `Add an element` button\n7. **select** in the list `Render a block` item, **select** the concerned block and **click** on the `insert` button\n8. **Click** on the `Viewed draft page`\n9. If everything works, the block appears\n10. **Return** to the draft tab and **Publish** your version\n\n## Add a link to the back office page\n\nIn your pages and blocks, you can add a link to the back and frontoffice of Daikoku. \n\nOnce on a page, on the top of the main input **click** on the `Add an element` buton . In the appeared modal, **choose** `Choose a link to the back office` and **click** on the `insert` button.\n\nThe following text `{{daikoku-links-<name-of-the-link>}}` has beed added at your cursor position. This Handlebars instruction will be modified, during the rendering process, by the url to the page. To use this link, you must wrap it in a link html tag, as in the following example :\n\n```\n<a href=\"{{daikoku-links-notifications}}\">My notifications</a>\n```\n\n## Navigate between cms page\n\nYou can navigate between your created pages using the `{{daikoku-page-url \"id-of-the-page\"}}` instruction. To simple add a link to a page, you can get back to the `Add an element` list, **select** `Insert a link to a cms page` item and **click** on `insert` button.\n\n```\n<a href=\"{{daikoku-page-url \"61fbaa95320100dbfca04d11\"}}\">See my apis</a>\n```\n\n## Custom path with path params\n\nFor some page, you may want use a path param in your page to adapt the content. Daikoku only supports path params at the end of the matching path. Examples:\n\n* The path set on the page is : `/foo`. \n* The call is `/foo/bar/second-param`\n  \nThe path params will be `bar` and `second-param`. To use the path params, Daikoku provides the `{{daikoku-path-param '<n>'}}` instructions, with the `n` parameter corresponding to the n-th path param of the route. Example:\n\n* The path set on the page is : /foo\n* The call is `/foo/bar/second-param`\n* use `{{daikoku-path-param '0'}}` and `{{daikoku-path-param '1'}}` to respectively retrieve the first and the second parameter\n\nSee the following example to create a page to display an Daikoku api:\n\n```html\n<div class=\"api-block\">\n    {{#daikoku-api \"{{daikoku-path-param '0'}}\" }}\n    <div class=\"api-name\"></div>\n    <span>{{api.name}}</span>\n    <div class=\"api-description\">\n        <h3>Description de l'API</h3>\n        <div> {{api.description}} </div>\n    </div>\n    {{/daikoku-api}}\n</div>\n```\n\n## A complete example\n\nIn this example, we will build the pages corresponding to the following template.\n\n```\nThe Layout (page)\n\nhead tag with a css and js script\n\n- body\n    header (block)\n\n    List of APIS (block)\n\nfooter (block)\n```\n\n@@@warning\nDon't forget to replace each parameter `<id-of...>` in each page\n@@@\n\n1. Create a new block with `navbar` as title and the content of the `navbar.html` tab\n2. Create a new block with `footer` as title and the content of the `footer.html` tab\n3. Create a new block with `api` as title and the content of the `api.html` tab (we will replace the `<id-of-the-layout-page>` parameter after the creation of the layout)\n4. Create a new block with `apis` as title and the content of the `apis.html` tab. Replace the `<id-of-the-api-page>` using the button at the top of the main input.\n5. Create a new block with `main` as title and the content of the `main.css` tab\n6. Create a new block with `script` as title and the content of the `script.js` tab\n7. Create the last page with `layout` as title and the content of the `layout.html` tab. Replace the `<id-of-the-css-page>` and `<id-of-the-js-page>` by the id of your created block (using the button at the top of the main input). \n8. Return to the `api` block and replace the `<id-of-the-layout-page>` by the id of the layout page.\n\nnavbar.html\n:   @@snip [navbar.html](./snippets/navbar.html) \n\nfooter.html\n:   @@snip [footer.html](./snippets/footer.html) \n\napi.html\n:   @@snip [api.html](./snippets/api.html) \n\napis.html\n:   @@snip [apis.html](./snippets/apis.html) \n\nmain.css\n:   @@snip [main.css](./snippets/main.css) \n\nscript.js\n:   @@snip [script.js](./snippets/script.js)\n\nlayout.html\n:   @@snip [layout.html](./snippets/layout.html)\n\n\n\n"
  },
  {
    "name": "index.md",
    "id": "/tenantusage/index.md",
    "url": "/tenantusage/index.html",
    "title": "Using Daikoku as Tenant admin",
    "content": "# Using Daikoku as Tenant admin\n\nNow we will see how to use Daikoku as tenant admin.\n\n@@@ index\n\n* [Managing Otoroshi instances](./1-otoroshi.md)\n* [Initialize tenant from otoroshi instance](./1.5-initialize.md)\n* [Managing teams](./2-teams.md)\n* [Managing assets](./3-assets.md)\n* [User messages](./4-messages.md)\n* [Translations](./5-translations.md)\n* [Display mode](./5.5-display.md)\n* [Using Content Management System](./6-cms.md)\n\n@@@\n"
  }
]